Tekla Open API Reference for Tekla Structures 2025
ContainerElement Methods
The ContainerElement type exposes the following members.
Methods
Name | Description
Add
 Adds a new element base to the end of the list.
Clear
 Removes all elements from the container instance.
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
CopyTo
 Copies the elements of the ICollection to an Array, starting at a particular Array index.
GetEnumerator
 Returns an enumerator that iterates through a collection.
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
ContainerElement Class
Tekla.Structures.Drawing Namespace